In [2]:
import pandas as pd

In [9]:
student_ad=pd.DataFrame({"Name":["Alex","Mark","Zack"],"Address":["NY 4th street","AD 7th Main","NY ChessCross"]},index=[0,1,2])

In [10]:
student_ad

   Name        Address
0  Alex  NY 4th street
1  Mark    AD 7th Main
2  Zack  NY ChessCross

In [17]:
student_ph=pd.DataFrame({"Name":["Alex","Mark","Zack"],"Phone NO":[123456789,9876543210,147852369]},index=[0,1,2])

In [18]:
student_ph

   Name    Phone NO
0  Alex   123456789
1  Mark  9876543210
2  Zack   147852369

In [19]:
df3=pd.merge(student_ad,student_ph,on="Name")

In [20]:
df3

   Name        Address    Phone NO
0  Alex  NY 4th street   123456789
1  Mark    AD 7th Main  9876543210
2  Zack  NY ChessCross   147852369

In [21]:
df4=pd.merge(student_ad,student_ph,on="Phone NO")
df4

KeyError: 'Phone NO'

In [23]:
student_ad_new=pd.DataFrame({"Name":["Alex","Mark","Zack","Josh"],"Address":["NY 4th street","AD 7th Main","NY ChessCross","MV Street"]},index=[0,1,2,3])

In [25]:
student_ph_new=pd.DataFrame({"Name":["Alex","Mark","Zack","Josh"],"Phone no":[123456789,9876543210,147852369,369852147]},index=[0,1,2,3])

In [28]:
df3=pd.merge(student_ad_new,student_ph,on="Name") # sql inner join ,common names between ad and ph will be output

In [29]:
df3

   Name        Address    Phone NO
0  Alex  NY 4th street   123456789
1  Mark    AD 7th Main  9876543210
2  Zack  NY ChessCross   147852369

In [34]:
df4=pd.merge(student_ad_new,student_ph,how="outer") # sql inner join ,common names between ad and ph will be output

In [35]:
df4

   Name        Address      Phone NO
0  Alex  NY 4th street  1.234568e+08
1  Mark    AD 7th Main  9.876543e+09
2  Zack  NY ChessCross  1.478524e+08
3  Josh      MV Street           NaN

In [36]:
df5=pd.merge(student_ad_new,student_ph,how="left") # sql inner join ,common names between ad and ph will be output

In [37]:
df5

   Name        Address      Phone NO
0  Alex  NY 4th street  1.234568e+08
1  Mark    AD 7th Main  9.876543e+09
2  Zack  NY ChessCross  1.478524e+08
3  Josh      MV Street           NaN

In [38]:
df6=pd.merge(student_ad_new,student_ph,how="right") # sql right join ie -everything fro right and common part, common part from left

In [39]:
df6

   Name        Address    Phone NO
0  Alex  NY 4th street   123456789
1  Mark    AD 7th Main  9876543210
2  Zack  NY ChessCross   147852369

In [40]:
df6=pd.merge(student_ad_new,student_ph,how="outer",indicator=True)

In [41]:
df6

   Name        Address      Phone NO     _merge
0  Alex  NY 4th street  1.234568e+08       both
1  Mark    AD 7th Main  9.876543e+09       both
2  Zack  NY ChessCross  1.478524e+08       both
3  Josh      MV Street           NaN  left_only

In [4]:
student_marks1=pd.DataFrame({"Name":["Alex","Mark","Zack"],"Score":[88,67,89],"Subject":["python","java","c++"]},index=[0,1,2])

In [5]:
student_marks2=pd.DataFrame({"Name":["Marten","Rojer","Kelly"],"Score":[76,87,76],"Subject":["python","java","dot net"]},index=[0,1,2])

In [6]:
pd.merge(student_marks1,student_marks2,on="Subject")

  Name_x  Score_x Subject  Name_y  Score_y
0   Alex       88  python  Marten       76
1   Mark       67    java   Rojer       87

In [7]:
pd.merge(student_marks1,student_marks2,on="Subject",suffixes=("_left","_right"))

  Name_left  Score_left Subject Name_right  Score_right
0      Alex          88  python     Marten           76
1      Mark          67    java      Rojer           87